In [1]:
import pandas as pd
import numpy as np
import os, glob, shutil

In [2]:
!pwd

/home/chuxian/DaaS/PYTHON-CLASS/SOLUTION

In [3]:
os.listdir("/home/chuxian/DaaS/PYTHON-CLASS/CSV_FILES")

['Economics.csv',
 'Maths.csv',
 'English.csv',
 'Accountancy Result.csv',
 'Business Studies.csv']

In [4]:
csv_file_path = "/home/chuxian/DaaS/PYTHON-CLASS/CSV_FILES"
excel_file_path = "/home/chuxian/DaaS/PYTHON-CLASS/EXCEL_FILES"

account = pd.read_csv(csv_file_path + "/Accountancy Result.csv")
economics = pd.read_csv(csv_file_path+"/Economics.csv")
english = pd.read_csv(csv_file_path+"/English.csv")
business = pd.read_csv(csv_file_path+"/Business Studies.csv")
maths = pd.read_csv(csv_file_path+"/Maths.csv")

In [5]:
print(account.head(), '\n', economics.head())

       Name  Mark
0  Akhilesh    97
1     Ruchi    69
2    Bhawna    19
3      Isha    76
4    Chetan    55
        Name  Mark
0  Akhilesh    13
1     Ruchi    51
2    Bhawna    53
3      Isha    11
4    Chetan    99

In [6]:
print(english.head(), '\n', business.head())

       Name  Mark
0  Akhilesh    36
1     Ruchi    85
2    Bhawna    72
3      Isha    68
4    Chetan    31
        Name  Mark
0  Akhilesh    34
1     Ruchi    53
2    Bhawna    40
3      Isha    22
4    Chetan    93

In [7]:
print(maths.head())

       Name  Mark
0  Akhilesh    47
1     Ruchi    86
2    Bhawna    41
3      Isha    46
4    Chetan    56

In [8]:
account.to_excel(excel_file_path+"/Accontancy.xlsx")
economics.to_excel(excel_file_path+"/Economics.xlsx")
english.to_excel(excel_file_path+"/English.xlsx")
maths.to_excel(excel_file_path+"/Maths.xlsx")
business.to_excel(excel_file_path+"/Business.xlsx")

In [9]:
files_in_pwd = os.listdir(excel_file_path)
print(files_in_pwd)
for i in files_in_pwd:
    print(f"File{i} is a {type(i)} file type")

['Business.xlsx', 'English.xlsx', 'Economics.xlsx', 'Accontancy.xlsx', 'Maths.xlsx']
FileBusiness.xlsx is a <class 'str'> file type
FileEnglish.xlsx is a <class 'str'> file type
FileEconomics.xlsx is a <class 'str'> file type
FileAccontancy.xlsx is a <class 'str'> file type
FileMaths.xlsx is a <class 'str'> file type

In [10]:
# new_excel_file_array = list()
# files_in_pwd = os.listdir(excel_file_path)
# for files in files_in_pwd:
#     print(f"==THE FILE IS {files}==")
#     if files.endswith(".xlsx"):
#         #shutil.move(csv_file_path+str(files), excel_file_path)
#         dataset = pd.read_excel(files)
#         new_excel_file_array.append(dataset)
#     else:
#         print(f"==THE FILE {files} IS NOT AN EXCEL FILE==")

# pass

In [11]:
# # CREATING NEW COLUMN FOR SUBJECT
# account_excel = pd.read_csv(excel_file_path+"/Accontancy.xlsx")
# economics_excel = pd.read_csv(excel_file_path+"/Economics.xlsx")
# english_excel = pd.read_csv(excel_file_path+"/English.xlsx")
# business_excel = pd.read_csv(excel_file_path+"/Business.xlsx")
# maths_excel = pd.read_csv(excel_file_path+"/Maths.xlsx")

In [12]:
# CREATING NEW COLUMN FOR SUBJECT
# ACCOUNTING
account["Subject"] = "Accountancy"
economics["Subject"] = "Economics"
english["Subject"] = "English"
business["Subject"] = "Business Studies"
maths["Subject"] = "Mathematics"

In [13]:
print(account.head(), '\n', economics.head())

       Name  Mark      Subject
0  Akhilesh    97  Accountancy
1     Ruchi    69  Accountancy
2    Bhawna    19  Accountancy
3      Isha    76  Accountancy
4    Chetan    55  Accountancy
        Name  Mark    Subject
0  Akhilesh    13  Economics
1     Ruchi    51  Economics
2    Bhawna    53  Economics
3      Isha    11  Economics
4    Chetan    99  Economics

In [14]:
print(english.head(), '\n', business.head())

       Name  Mark  Subject
0  Akhilesh    36  English
1     Ruchi    85  English
2    Bhawna    72  English
3      Isha    68  English
4    Chetan    31  English
        Name  Mark           Subject
0  Akhilesh    34  Business Studies
1     Ruchi    53  Business Studies
2    Bhawna    40  Business Studies
3      Isha    22  Business Studies
4    Chetan    93  Business Studies

In [15]:
print(maths.head())

       Name  Mark      Subject
0  Akhilesh    47  Mathematics
1     Ruchi    86  Mathematics
2    Bhawna    41  Mathematics
3      Isha    46  Mathematics
4    Chetan    56  Mathematics

In [16]:
con_file = [account, economics,english,business,maths]
Grade = pd.concat(con_file, axis = 0)
Grade.head()

       Name  Mark      Subject
0  Akhilesh    97  Accountancy
1     Ruchi    69  Accountancy
2    Bhawna    19  Accountancy
3      Isha    76  Accountancy
4    Chetan    55  Accountancy

In [17]:
Grade.shape

(600, 3)

In [18]:
# CREATING PIVOT
table = pd.pivot_table(Grade, values='Mark', index="Name",
                    columns="Subject", aggfunc=[np.sum])
table.head()

                           sum
Subject            Accountancy Business Studies Economics English Mathematics
Name
Abhinandan Kashyap          96               78        73      34          36
Adbhut Gupta                97               53        77      33          31
Akhilesh                    97               34        13      36          47
Akshay Verma                83               29        68      98          81
Amandeep                    99               63        47      96          80

In [19]:
Grade.to_excel("Grade_sheet.xlsx", sheet_name = "Grade", index = False)

In [20]:
gr = pd.read_excel("Grade_sheet.xlsx")
gr.head()

       Name  Mark      Subject
0  Akhilesh    97  Accountancy
1     Ruchi    69  Accountancy
2    Bhawna    19  Accountancy
3      Isha    76  Accountancy
4    Chetan    55  Accountancy

In [23]:
tb_pivot = gr.pivot(index="Name", columns="Subject", values="Mark")
tb_pivot.head(n = 6)

Subject,Accountancy,Business Studies,Economics,English,Mathematics
Name,,,,,
Abhinandan Kashyap,96,78,73,34,36
Adbhut Gupta,97,53,77,33,31
Akhilesh,97,34,13,36,47
Akshay Verma,83,29,68,98,81
Amandeep,99,63,47,96,80
Amandeep Singh,52,26,73,70,35

In [24]:
tb_pivot.columns

Index(['Accountancy', 'Business Studies', 'Economics', 'English',
       'Mathematics'],
      dtype='object', name='Subject')

In [37]:
tb_pivot["Total"] = tb_pivot['Accountancy']+tb_pivot['Business Studies']+tb_pivot['Economics']+tb_pivot['English']+tb_pivot['Mathematics']
tb_pivot["Average"] = round((tb_pivot['Accountancy']+tb_pivot['Business Studies']+tb_pivot['Economics']+tb_pivot['English']+tb_pivot['Mathematics'])/4)
tb_pivot.head(n=6).sort_values(by = "Name")

Subject,Accountancy,Business Studies,Economics,English,Mathematics,Total,Average
Name,,,,,,,
Abhinandan Kashyap,96,78,73,34,36,317,79.0
Adbhut Gupta,97,53,77,33,31,291,73.0
Akhilesh,97,34,13,36,47,227,57.0
Akshay Verma,83,29,68,98,81,359,90.0
Amandeep,99,63,47,96,80,385,96.0
Amandeep Singh,52,26,73,70,35,256,64.0

In [38]:
tb_pivot.tail(n=10).sort_values(by = "Name")

Subject,Accountancy,Business Studies,Economics,English,Mathematics,Total,Average
Name,,,,,,,
Suman,67,54,66,17,22,226,56.0
Sunny,84,69,77,17,63,310,78.0
Suresh,75,78,30,61,78,322,80.0
Surinder Verma,51,77,14,80,30,252,63.0
Tina,69,55,90,35,64,313,78.0
Vicky Vishisht,42,18,28,51,39,178,44.0
Vipul,64,59,37,81,50,291,73.0
Vishav Sehajpal,14,45,18,35,97,209,52.0
Yogesh Sahgal,26,11,74,76,49,236,59.0
Yogesh Verma,78,13,14,85,77,267,67.0

In [41]:
from pathlib import Path

print(Path())

.